## Задание №3
К сожалению, исполнение написанных команд не удастся показать в этом ноутбуке. Видимо в sqlite3 есть некоторые ограниченния, которые не позволяют в полную меру использовать синтаксис SQL. Все команды зафиксированы, ниже. Для работы с данными можно создать таблицу через create table, либо воспользоваться временной. Рекомендую проверить исполнение команд в SQL Server Management Studio, выполнял данную работу в указанной среде.

In [ ]:
import sqlite3

In [42]:
conn = sqlite3.connect("mydatabase.db") 
coursor = conn.cursor()

In [43]:
coursor.execute("""
CREATE TABLE EMPS
(name, pasp, dt1, dt2)
""")
conn.commit()

In [44]:
coursor.execute("""
CREATE TABLE JOBS
(name, department, employer, dt1, dt2)
""")
conn.commit()

In [45]:
emps_data = [
            ('ВАСЯ', '4500', '2019-01-01', 'null'),
            ('ВАСЯ2', '4501', '2019-01-05', 'null'),
            ('ВАСЯ3', '4502', '2019-01-01', '2019-08-01'),
            ('ВАСЯ4', '4503', '2019-01-05', 'null'), 
            ('ВАСЯ4', '4503', '2019-01-05', 'null'), 
            ('ВАСЯ55', '4504', '2019-01-09', 'null')
            ]
jobs_data = [
            ('ВАСЯ', 'finance', 'Yandex', '2018-06-01','2018-08-02'),
            ('ВАСЯ', 'hr', 'Moscow exchange', '2017-06-01','2017-08-01'),
            ('ВАСЯ2', 'finance', 'Rambler', '2018-05-04','2018-08-01'),
            ('ВАСЯ3', 'hr', 'Rambler', '2018-01-04','2018-08-23'),
            ('ВАСЯ4', 'it', 'Alfa bank', '2018-01-05', '2018-07-01'),
            ('ВАСЯ4', 'hr', 'Rambler', '2018-01-05', '2018-07-01'),
            ('ВАСЯ4', 'it', 'Alfa bank', '2018-01-05', '2018-07-01'),
            ('ВАСЯ4', 'it', 'Rambler', '2018-01-05', '2018-07-01'),
            ('ВАСЯ5', 'strategy', 'Alfa bank', '2018-01-03', '2018-07-02')
]

In [46]:
coursor.executemany("INSERT INTO EMPS VALUES (?,?,?,?)", emps_data)
conn.commit()

In [47]:
coursor.executemany("INSERT INTO JOBS VALUES (?,?,?,?,?)", jobs_data)
conn.commit()

In [55]:
# зад 1 пункт 1 версия запроса 1
SQL_l_1_ver1 = """
select COUNT ( distinct e.name ) from EMPS e
left join JOBS j on j.name=e.name
where e.dt2 is NULL and j.name is null
"""
# зад 1 пункт 1 версия запроса 2
SQL_l_1_ver2 = """
select COUNT (distinct e.name ) from EMPS e
left join JOBS j on j.name=e.name
where e.dt2 is NULL and j.name is not null
"""
# зад 1 пункт 2

SQL_1_2 = """
select pr, COUNT ( distinct name ) from
(
select e.name, pr=case when j.name is null then 0 else 1 end from EMPS e
left join JOBS j on j.name=e.name
where e.dt2 is NULL
) w
group by pr
"""

In [56]:
# зад 2 пункт 1
# количество мест работы по сотрудникам
SQL_2_1="""
select distinct e.name, count ( distinct (employer)) from EMPS e
left join JOBS j on j.name=e.name
where e.dt2 is NULL and j.name is not null
group by e.name
"""

# зад 2 пункт 2
# количество отделов, в которых работал сотрудник
SQL_2_2="""
select distinct e.name, count ( distinct concat (employer,department)) from EMPS e
left join JOBS j on j.name=e.name
where e.dt2 is NULL and j.name is not null
group by e.name
"""

# зад 2 пункт 3
# общий трудовой стаж на предыдущих местах работы. Выведете результат по убыванию трудового стажа
SQL_2_3="""
select distinct name, [Трудовой стаж]=SUM (ps) from
(select distinct e.name, employer,ps=DATEDIFF ( DAY , j.dt1 , j.dt2) from EMPS e
left join JOBS j on j.name=e.name
where e.dt2 is NULL and j.name is not null ) q
group by name
order by 2 DESC
""""

SyntaxError: EOL while scanning string literal (<ipython-input-56-810dc2df770e>, line 28)

In [ ]:
# зад 3 пункт 1
# покажите самого популярного работодателя
sql_3_1="""
select top 1 *from
(
select lm=count(distinct e.name), employer from EMPS e
left join JOBS j on j.name=e.name
where j.name is not null
group by employer
)l
order by 1 DESC
"""

# зад 3 пункт 2
# покажите самую востребованную специальность
sql_3_2="""
select top 1 *from
(
select pn=count(distinct e.name), department from EMPS e
left join JOBS j on j.name=e.name
where j.name is not null
group by department
)n
order by 1 DESC
"""